src/Documents/ВозвратИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВозвратИнвентаря</Name>
			<BasedOn>
				<xr:Item>Document.ВыдачаИнвентаря</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИнвентарьУСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвентарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инвентарь</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияИнвентаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ИнвентарьУСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ИнвентарьУСотрудников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвентарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инвентарь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/СостоянияИнвентаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияИнвентаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исправен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утрачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ВозвратИнвентаря/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить("РегистрНакопления.ИнвентарьУСотрудников");
    Элемент.Режим = РежимБлокировкиДанных.Исключительный;
    Элемент.ИсточникДанных = Позиции;
    Элемент.ИспользоватьИзИсточникаДанных("Инвентарь", "Инвентарь");
    Элемент.УстановитьЗначение("Сотрудник", Сотрудник);
    Блокировка.Заблокировать();

    Движения.ИнвентарьУСотрудников.Записывать = Истина;

    Для Каждого СтрокаПозиции Из Позиции Цикл
        Движение = Движения.ИнвентарьУСотрудников.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период      = Дата;
        Движение.Сотрудник   = Сотрудник;
        Движение.Инвентарь   = СтрокаПозиции.Инвентарь;
        Движение.Количество  = СтрокаПозиции.Количество;
    КонецЦикла;

    Движения.ИнвентарьУСотрудников.Записать();

    ПроверитьОстатки(Отказ);

КонецПроцедуры

Процедура ПроверитьОстатки(Отказ)

    СписокИнвентаря = Позиции.ВыгрузитьКолонку("Инвентарь");

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    Остатки.Инвентарь          КАК Инвентарь,
        |    Остатки.КоличествоОстаток  КАК Остаток
        |ИЗ
        |    РегистрНакопления.ИнвентарьУСотрудников.Остатки(
        |        &МоментВремени,
        |        Сотрудник = &Сотрудник
        |            И Инвентарь В (&СписокИнвентаря)) КАК Остатки
        |ГДЕ
        |    Остатки.КоличествоОстаток < 0";

    Запрос.УстановитьПараметр("МоментВремени",
        Новый Граница(МоментВремени(), ВидГраницы.Включая));
    Запрос.УстановитьПараметр("Сотрудник",       Сотрудник);
    Запрос.УстановитьПараметр("СписокИнвентаря", СписокИнвентаря);

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = СтрШаблон(
            "У сотрудника ""%1"" не числится ""%2"" в таком количестве. Не хватает: %3",
            Сотрудник, Выборка.Инвентарь, -Выборка.Остаток);
        Сообщение.Сообщить();
        Отказ = Истина;
    КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыдачаИнвентаря") Тогда

        Сотрудник         = ДанныеЗаполнения.Сотрудник;
        ДокументОснование = ДанныеЗаполнения;

        Позиции.Очистить();
        Для Каждого СтрокаОснования Из ДанныеЗаполнения.Позиции Цикл
            НоваяСтрока = Позиции.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
            НоваяСтрока.Состояние = Перечисления.СостоянияИнвентаря.Исправен;
        КонецЦикла;

    КонецЕсли;

КонецПроцедуры
